# StructuralSectionLangleBoltSpacingShorterFlange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionLangleBoltSpacingShorterFlange Property
ParameterTypeId Class See Also
---
"Bolt Spacing Shorter Flange"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionLangleBoltSpacingShorterFlange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionLangleBoltSpacingShorterFlange As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionLangleBoltSpacingShorterFlange {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace